12/data/attachments/e8fa317313d3d1e2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d1312f10-2f27-468c-a685-2afde87b5468</nif:username>
            <nif:friendToBeAdded>Thomas_reach_Friend_1846_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>